###  Part # 1
  #### Terraform Initialization `success`
  #### Terraform Plan `success`
  ```
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip_association.nat-instace-eip-association must be replaced
-/+ resource "aws_eip_association" "nat-instace-eip-association" {
      ~ id                   = "eipassoc-00e68534e7a97b9da" -> (known after apply)
      ~ instance_id          = "i-07a2b21b75f8d9ed8" # forces replacement -> (known after apply) # forces replacement
      ~ network_interface_id = "eni-0c34a64884901434a" -> (known after apply)
      ~ private_ip_address   = "10.0.4.241" -> (known after apply)
      ~ public_ip            = "13.37.74.228" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_instance.nat-instance must be replaced
-/+ resource "aws_instance" "nat-instance" {
      ~ ami                                  = "ami-03605ed178c26cfab" -> "ami-073ef04c366723b30" # forces replacement
      ~ arn                                  = "arn:aws:ec2:eu-west-3:377346518720:instance/i-07a2b21b75f8d9ed8" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "eu-west-3a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-07a2b21b75f8d9ed8" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0c34a64884901434a" -> (known after apply)
      ~ private_dns                          = "ip-10-0-4-241.eu-west-3.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.4.241" -> (known after apply)
      ~ public_dns                           = "ec2-13-37-74-228.eu-west-3.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "13.37.74.228" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      - source_dest_check                    = false -> null
      + spot_instance_request_id             = (known after apply)
      ~ subnet_id                            = "subnet-04cb8a49007ff9679" -> (known after apply)
        tags                                 = {
            "Name" = "nat-instance"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-02c0fa6e57cd18c58",
        ] -> (known after apply)
        # (6 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-08fe84d2f0fbc915b" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

  ```
  *Pusher: @iMichka, Action: `pull_request`, Workflow: `Production`*